app/views/item/_form.html.erb

      <%= f.label :category, 'Categoria', for:"sel" %>
      <%= f.select "category", options_from_collection_for_select(Category.all, :name, :name), class:"form-control" %>
---
SELECT "categories".* FROM "categories"