app/views/category/new.html.erb

  <tbody>
  <% Category.all.each do |c| %>
---
SELECT "categories".* FROM "categories"