app/controllers/category_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2020-12-09 19:37:01.419205"], ["updated_at", "2020-12-09 19:37:01.419205"]]
---
    def create
      @category = Category.new(params.require(:category).permit(:name))
      @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 14]]
---
    def destroy
      category = Category.find(params[:id])
      category.destroy