app/controllers/item_controller.rb

INSERT INTO "items" ("name", "category", "description", "deadline", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @item = Item.new(item_params)
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "category" = ?, "deadline" = ?, "comment" = ?, "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["category", "Rails"], ["deadline", "2020-12-25"], ["comment", ""], ["done", 0], ["updated_at", "2020-12-19 22:51:07.055715"], ["id", 37]]
---
    def update
      @item = Item.find(params[:id])

      if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 30]]
---
    def destroy
      item = Item.find(params[:id])
      item.destroy

SELECT "items".* FROM "items" WHERE (name LIKE '%Ruby%')
---
      def search
        @items = Item.where("name LIKE ?", "%"+params[:q]+"%")